/************************************版权申明********************************************
**                             广州大彩光电科技有限公司
**                             http://www.gz-dc.com
**-----------------------------------文件信息--------------------------------------------
** 文件名称:   hmi_user_uart.c
** 修改时间:   2018-05-18
** 文件说明:   用户MCU串口驱动函数库
** 技术支持：  Tel: 020-82186683  Email: hmi@gz-dc.com Web:www.gz-dc.com
--------------------------------------------------------------------------------------*/
#include "hmi_user_uart.h"

void UartInit()
{
    SCON=0x50;     //8位UART，BPS可变,允许串行接收控制位
    TMOD |=0x20;   //定时器1工作方式2(8位自动重装方式)
    PCON |=0x80;   //波特率加倍
    TH1=0xFD;  
    TL1=0xFD;      //19200波特率 ，11.0592M 
    IE |=0X90;     //Enable Serial Interrupt 
    TR1=1;  
    //ES = 0;   
}

void  SendChar(uchar t) 
{
    SBUF=t;
    while(TI==0);
    TI=0;           
} 